brew "python@3.13", link: false
brew "ffmpeg"
brew "go"
brew "imagemagick"
brew "neovim"
brew "node"
brew "poppler"
brew "rust"
brew "virtualenv"
brew "yarn"
vscode "asvetliakov.vscode-neovim"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "platformio.platformio-ide"
vscode "vscodevim.vim"
