brew "python@3.13"
brew "ffmpeg"
brew "go"
brew "imagemagick"
brew "neovim"
brew "node"
brew "platformio"
brew "poppler"
brew "python-setuptools"
brew "rust"
brew "tio"
brew "uv"
brew "virtualenv"
brew "yarn"
vscode "asvetliakov.vscode-neovim"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "platformio.platformio-ide"
vscode "vscodevim.vim"
