# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Package acting as bridge between Node projects and their package managers
brew "corepack"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Safe, concurrent, practical language
brew "rust"
# Simple TTY terminal I/O application
brew "tio"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv"
cask "font-blex-mono-nerd-font"
cask "font-cascadia-code-nf"
cask "font-caskaydia-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-intel-one-mono"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-nerd-font"
vscode "asvetliakov.vscode-neovim"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "platformio.platformio-ide"
vscode "vscodevim.vim"
flatpak "au.stevetech.yafi"
flatpak "cc.arduino.IDE2"
flatpak "com.axosoft.GitKraken"
flatpak "com.borgbase.Vorta"
flatpak "com.calibre_ebook.calibre"
flatpak "com.github.PintaProject.Pinta"
flatpak "com.github.flxzt.rnote"
flatpak "com.github.marktext.marktext"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.github.wwmm.easyeffects"
flatpak "com.github.zocker_160.SyncThingy"
flatpak "com.google.Chrome"
flatpak "com.rustdesk.RustDesk"
flatpak "com.slack.Slack"
flatpak "com.spotify.Client"
flatpak "com.usebottles.bottles"
flatpak "com.valvesoftware.Steam"
flatpak "com.yubico.yubioath", remote: "flathub-beta", url: "https://dl.flathub.org/beta-repo/"
flatpak "com.yubico.yubioath"
flatpak "com.zettlr.Zettlr"
flatpak "de.bund.ausweisapp.ausweisapp2"
flatpak "dev.vencord.Vesktop"
flatpak "fr.handbrake.ghb"
flatpak "io.github.bcpierce00.unison"
flatpak "io.github.dvlv.boxbuddyrs"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.kolunmi.Bazaar"
flatpak "io.github.seadve.Kooha"
flatpak "io.missioncenter.MissionCenter"
flatpak "io.podman_desktop.PodmanDesktop"
flatpak "md.obsidian.Obsidian"
flatpak "me.iepure.devtoolbox"
flatpak "no.mifi.losslesscut"
flatpak "org.angryip.ipscan"
flatpak "org.chromium.Chromium"
flatpak "org.cockpit_project.CockpitClient"
flatpak "org.fedoraproject.MediaWriter"
flatpak "org.fkoehler.KTailctl"
flatpak "org.freedesktop.Bustle"
flatpak "org.gnome.Boxes"
flatpak "org.gnome.dspy"
flatpak "org.inkscape.Inkscape"
flatpak "org.jupyter.JupyterLab"
flatpak "org.kde.filelight"
flatpak "org.kde.gwenview"
flatpak "org.kde.haruna"
flatpak "org.kde.isoimagewriter"
flatpak "org.kde.kcalc"
flatpak "org.kde.kclock"
flatpak "org.kde.kdenlive"
flatpak "org.kde.kolourpaint"
flatpak "org.kde.kweather"
flatpak "org.kde.okular"
flatpak "org.keepassxc.KeePassXC"
flatpak "org.kicad.KiCad"
flatpak "org.libreoffice.LibreOffice"
flatpak "org.localsend.localsend_app"
flatpak "org.mozilla.firefox"
flatpak "org.raspberrypi.rpi-imager"
flatpak "org.sqlitebrowser.sqlitebrowser"
flatpak "org.videolan.VLC"
flatpak "org.wezfurlong.wezterm"
flatpak "org.wireshark.Wireshark"
flatpak "org.zotero.Zotero"
flatpak "org.zulip.Zulip"
flatpak "rocks.koreader.KOReader"
flatpak "us.zoom.Zoom"
